In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
df = DataFrame({'letters':['A','A','A','B','C','B'],
                'nums': [1,2,1,3,1,5]})
df

  letters  nums
0       A     1
1       A     2
2       A     1
3       B     3
4       C     1
5       B     5

In [4]:
#check duplicates
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [6]:
#drop duplicates
df.drop_duplicates()

  letters  nums
0       A     1
1       A     2
3       B     3
4       C     1
5       B     5

In [10]:

#To remove duplicates and keep last occurrences, use keep.
df = DataFrame({'letters':['A','A','A','B','C','B'],
                'nums': [1,2,1,3,1,5]})
df

df.drop_duplicates(['letters'],keep='last')

  letters  nums
2       A     1
4       C     1
5       B     5

In [12]:
#By default the first value was taken for the duplicates, we can also take the last value instead
df.drop_duplicates(subset='nums')

  letters  nums
0       A     1
1       A     2
3       B     3
5       B     5